// Напишите программу, которая на вход принимает два числа и выдает,
// какое число большее, а какое меньшее.

int a = 1;
int b = 2;

if (a == b)
{
    Console.Write("Числа равны");
}
if (a > b)
{
    Console.Write("Первое число больше");
}
if (a < b)
{
    Console.Write("Второе число больше");
}
