// Напишите программу, которая на вход принимает число
// и выдает, является ли число четным.

int number = 4;

if (number%2 == 0)
{
    Console.WriteLine("четное");
}
else
{
    Console.WriteLine("нечетное");
}